app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.new(school_class_params)
        if @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Flatiron School of dumbasses"], ["room_number", -9], ["created_at", "2021-05-06 03:58:10.565652"], ["updated_at", "2021-05-06 03:58:10.565652"]]

    def update
        if @school_class.update(school_class_params)
---
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 1], ["updated_at", "2021-05-06 04:05:08.171483"], ["id", 1]]

    def set_school_class
        @school_class = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]